Data Frames:
1. Data Manipulation
2. Data Cleaning
3. Data Aggregation

In [1]:
import pandas as pd 
import numpy as np

In [6]:
languages = {'Languages': ['Python', 'SQL', 'Java', 'C++'],
             'rating': [4, 5, 2, 3]}
df = pd.DataFrame(languages,columns=['Languages','rating'])
df

  Languages  rating
0    Python       4
1       SQL       5
2      Java       2
3       C++       3

In [17]:
customers = {'Names':['jon','peter','tony','chris'],
             'products':['knives','crossword puzzles','books','guns&bullets'],
             'Quantity':[4,2,5,2],
             'Price_per_Quantity':[2000,3000,40000,50000],
             'Date_bought':pd.date_range('2025-01-01',periods=4)
             }
df = pd.DataFrame(customers,np.arange(1,5))
df

   Names           products  Quantity  Price_per_Quantity Date_bought
1    jon             knives         4                2000  2025-01-01
2  peter  crossword puzzles         2                3000  2025-01-02
3   tony              books         5               40000  2025-01-03
4  chris       guns&bullets         2               50000  2025-01-04

In [ ]:
# Accessing Columns

df['Names'] # Accessing Single Column
df[['Names','products']] # Accessing Multiple Columns

   Names           products
1    jon             knives
2  peter  crossword puzzles
3   tony              books
4  chris       guns&bullets

In [ ]:
# Accessing data by rows
print(df.loc[1]) # Data of first row and accessing row by label---> Label-Based Indexing
print(df.iloc[1]) # Accessing row by index and getting second row of data ---> Integer-Based Indexing

Names                                 jon
products                           knives
Quantity                                4
Price_per_Quantity                   2000
Date_bought           2025-01-01 00:00:00
Name: 1, dtype: object
Names                               peter
products                crossword puzzles
Quantity                                2
Price_per_Quantity                   3000
Date_bought           2025-01-02 00:00:00
Name: 2, dtype: object

In [38]:
# Adding new column
Age = [25,29,30,75]
df['Age']=Age
df['Discount']=0.1
df

,Customer_Names,products,Quantity,Price_per_Quantity,Date_bought,Age,Discount
1,jon,knives,4,2000,2025-01-01,25,0.1
2,peter,crossword puzzles,2,3000,2025-01-02,29,0.1
3,tony,books,5,40000,2025-01-03,30,0.1
4,chris,guns&bullets,2,50000,2025-01-04,75,0.1

In [30]:
# Filtering
print(df[df['Age']>25]['Names'])

2    peter
3     tony
4    chris
Name: Names, dtype: object

In [34]:
# Renaming columns
df.rename(columns={'Names':'Customer_Names'},inplace=True)
df

,Customer_Names,products,Quantity,Price_per_Quantity,Date_bought,Age
1,jon,knives,4,2000,2025-01-01,25
2,peter,crossword puzzles,2,3000,2025-01-02,29
3,tony,books,5,40000,2025-01-03,30
4,chris,guns&bullets,2,50000,2025-01-04,75

In [37]:
#sorting
print(df.sort_values('Price_per_Quantity',ascending=False))
print(df.sort_index())

  Customer_Names           products  Quantity  Price_per_Quantity Date_bought  \
4          chris       guns&bullets         2               50000  2025-01-04
3           tony              books         5               40000  2025-01-03
2          peter  crossword puzzles         2                3000  2025-01-02
1            jon             knives         4                2000  2025-01-01

   Age
4   75
3   30
2   29
1   25
  Customer_Names           products  Quantity  Price_per_Quantity Date_bought  \
1            jon             knives         4                2000  2025-01-01
2          peter  crossword puzzles         2                3000  2025-01-02
3           tony              books         5               40000  2025-01-03
4          chris       guns&bullets         2               50000  2025-01-04

   Age
1   25
2   29
3   30
4   75

In [40]:
# Updating the column values
df['Quantity']=df['Quantity']+2
df

,Customer_Names,products,Quantity,Price_per_Quantity,Date_bought,Age,Discount
1,jon,knives,8,2000,2025-01-01,25,0.1
2,peter,crossword puzzles,6,3000,2025-01-02,29,0.1
3,tony,books,9,40000,2025-01-03,30,0.1
4,chris,guns&bullets,6,50000,2025-01-04,75,0.1

In [ ]:
# Deleting rows and columns
print(df.drop(columns='Age',inplace=False)) # Deleting by column
print(df.drop(index=1,inplace=False)) # deleting by row

  Customer_Names           products  Quantity  Price_per_Quantity Date_bought  \
1            jon             knives         8                2000  2025-01-01
2          peter  crossword puzzles         6                3000  2025-01-02
3           tony              books         9               40000  2025-01-03
4          chris       guns&bullets         6               50000  2025-01-04

   Discount
1       0.1
2       0.1
3       0.1
4       0.1
  Customer_Names           products  Quantity  Price_per_Quantity Date_bought  \
2          peter  crossword puzzles         6                3000  2025-01-02
3           tony              books         9               40000  2025-01-03
4          chris       guns&bullets         6               50000  2025-01-04

   Age  Discount
2   29       0.1
3   30       0.1
4   75       0.1

In [13]:
d = [{'a':1,'v':2},{'a':23,'b':34,'v':23}]
df1=pd.DataFrame(d)
df1

    a   v     b
0   1   2   NaN
1  23  23  34.0

In [ ]:
#Data Cleaning ---> Handling missing values and filling null values
df1.isnull()
df1.fillna(0)
df1
df1.dropna()#remove rows containing None

    a   v     b
1  23  23  34.0

In [60]:
from datetime import datetime,timedelta
now=datetime.now()
print(now)
dates=pd.date_range(datetime.now(),periods=7,freq='D')
df2 = pd.DataFrame({
    'Dates': dates,
    'Weekdays': dates.strftime('%A'),
    'Count': [12, 34, 45, 56, 78, 56,None]  # Only 6 values provided
})

print(df2)

2025-02-22 17:44:46.791419
                       Dates   Weekdays  Count
0 2025-02-22 17:44:46.791419   Saturday   12.0
1 2025-02-23 17:44:46.791419     Sunday   34.0
2 2025-02-24 17:44:46.791419     Monday   45.0
3 2025-02-25 17:44:46.791419    Tuesday   56.0
4 2025-02-26 17:44:46.791419  Wednesday   78.0
5 2025-02-27 17:44:46.791419   Thursday   56.0
6 2025-02-28 17:44:46.791419     Friday    NaN

In [64]:
df2.isnull()
df2.fillna(0)
df2.dropna(inplace=True)
df2

                       Dates   Weekdays  Count
0 2025-02-22 17:44:46.791419   Saturday   12.0
1 2025-02-23 17:44:46.791419     Sunday   34.0
2 2025-02-24 17:44:46.791419     Monday   45.0
3 2025-02-25 17:44:46.791419    Tuesday   56.0
4 2025-02-26 17:44:46.791419  Wednesday   78.0
5 2025-02-27 17:44:46.791419   Thursday   56.0

In [ ]:
# Data Aggregation
# Aggregation Functions
print(df['Price_per_Quantity'].sum())
print(df['Age'].mean())
print(df['Quantity'].max())

95000
39.75
9

In [ ]:
# Group by
df['Department']=['HR','IT','HR','IT']
print(df.groupby('Department')['Price_per_Quantity'].sum()) # Average cost per department

Department
HR    42000
IT    53000
Name: Price_per_Quantity, dtype: int64

In [72]:
# Merging and Joining DataFrames
df3 = pd.DataFrame({'ID':[1,2],'Name':['Poo','Joo']})
df4=pd.DataFrame({'ID':[1,2],'Salary':[45000,60000]})
print(pd.merge(df3,df4,on="ID"))

   ID Name  Salary
0   1  Poo   45000
1   2  Joo   60000